---
kind: type
id: T:Autodesk.Revit.DB.Mechanical.SpaceSetIterator
source: html/5851a67d-022e-b21e-1d1d-e5984446bfb4.htm
---
# Autodesk.Revit.DB.Mechanical.SpaceSetIterator

An iterator to a set.

## Syntax (C#)
```csharp
public abstract class SpaceSetIterator : APIObject,
	IEnumerator
```